[
    {
        "title": "WeightGraph",
        "images": [
            "weightgraph_home.png",
            "weightgraph_splits.png",
            "weightgraph_workout.png"
        ],
        "languages": [
            "react"
        ],
        "description": [
            "Dieses Projekt ist für einen Freund entstanden, der eine einfache Möglichkeit suchte, seine Trainingseinheiten zu protokollieren.",
            "Die Anwendung ermöglicht die Erstellung von Trainingseinheiten, das Eintragen von Gewichten während des Trainings und das Anzeigen der Trainingshistorie.",
            "Alle Daten werden dabei auf dem Gerät gespeichert, können aber auch über Dropbox synchronisiert werden."
        ],
        "link": {
            "url": "https://fillmer-development.github.io/weightGraph/",
            "content": "zur Live-Demo"
        }
    },
    {
        "title": "Image Processing Server",
        "images": [
            "image_processing.gif"
        ],
        "languages": [
            "python"
        ],
        "link": {
            "url": "https://github.com/fillmer-development/image_processing_server",
            "content": "zum öffentlichen Quelltext"
        },
        "description": [
            "Dieses Programm ist als Nebenprojekt für eine komplexere Anwendung entstanden",
            "Es ermöglicht das Speichern und einfache Manipulieren von Bildern, ohne dabei lange Wartezeiten zu verursachen.",
            "Gerade auf Webseiten kann man damit langsame Verbindungen kompensieren und die Bilder in verschiedenen Auflösungen präsentieren.",
            "Auch Sie können kostenlos von dieser Technologie profitieren."
        ]
    },
    {
        "title": "TMU-Planer",
        "images": [
            "tmu-planer.png"
        ],
        "languages": [
            "react"
        ],
        "link": {
            "url": "https://fillmer-development.github.io/tmu-planer-live/",
            "content": "zur Anwendung"
        },
        "description": [
            "Der Kunde wollte eine sehr schlichte Anwendung, mit der er Arbeitsaufwände anhand von <em>time-measurement-units (TMU)</em> planen kann",
            "Die TMU-Daten werden zunächst in das Programm eingelesen, um im nächsten Schritt zur Erstellung von Arbeitsplänen verwendet werden zu können.",
            "<em>Wenn Sie die Anwendung gerne ausprobieren möchten, finden Sie <a download target='window' href='/assets/tmu-grunddaten.csv'>hier</a> passende Beispieldaten dazu. Diese können im Menü (Zahnrad oben rechts klicken) eingefügt werden.</em>"
        ]
    }
]